import './Pen.css';
import Effects from '../../Effects/Effects';

const Pen = () => {
    return (
        <div id = "Pen">
            <Effects
                id="About_Pen"
                title="Editors' Corner"
            />
            <div className="container pb-5" lang = "bn">
                <div className="row mt-3 mb-3 g-4">
                    <div className="col-md-6">
                        <div className = "wrap">
                            <div className="box">
                                <i className="fas fa-quote-left fa2"></i>
                                <div className="text">
                                    <i className="fas fa-quote-right fa1"></i>
                                    <h3>দেবার্ঘ্য কুমার চক্রবর্তী</h3>
                                    <div className = "overflow-control">
                                        <div className = "quote">
                                            <p>কোলকাতা থেকে অনেক দূরে থেকেও শহরের হৃদয়ের কাছাকাছি থাকতে পারার ব্যকুলতা বারবার ফিরিয়ে এনেছে বন্ধুদের কাছে, ছেড়ে আসা টিফিন টাইমে বা খেলার মাঠে।
                                                সময়ের নিয়মে আগের মত সবাই মিলে ক্লাসরুমের হইহুল্লোড়ের দিন না আসুক; একসাথে সবাই মিলে হাতে হাত রেখে কিছু তো করাই যায়। "আমাদের স্বাধীন কলম" সেই মিলিত প্রয়াস।
                                                শুধু স্কুল না, সমস্ত কাছের মানুষদের কাজ এক ছাতার তলায় এনে দিয়েছে। এক দুই করে চারবছর পেরোলো। বিনিদ্র রাত্রিগুলো কখন পত্রিকা সাজাতে কেটে যায় খেয়াল থাকে না।
                                                কিন্তু যখন মহমায়ার আগমনের প্রাক্কালে সকলের কাছে পৌঁছে যায় আমাদের চেষ্টা, সে আনন্দ প্রকাশের ভাষা থাকে না। যে সৃষ্টির সৃষ্টি আরম্ভ হয়েছিল দূরদেশে, ছড়িয়ে পড়ুক সবার মধ্যে।</p>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div className="col-md-6 reverse">
                        <div className="wrap">
                            <div className="box">
                                <i className="fas fa-quote-right fa1"></i>
                                <div className="text">
                                    <h3>অরিত্র দত্ত </h3>
                                    <div className="overflow-control">
                                        <div className = "quote">
                                            <p>সালটা ২০১৭। হঠাৎ-ই একদিন জুলাই মাসের দিকে দেবার্ঘ্য একটা প্রস্তাব আনে। আচ্ছা একটা নিজেদের ম্যাগাজিন প্রকাশ করলে কেমন হয়! যথসামান্য কিছু লেখা-লিখি করি বলে প্রস্তাবটা বেশ ভালই লেগেছিল।
                                                নিজেদের একটা লেখার প্লাটফর্ম হলে মন্দ হয়না। কিন্তু সেই ধারণাকে বাস্তবায়িত করা যে কোনো মতেই সহজ কাজ হবে না তা বুঝতে বেশি দেরি হয়নি।
                                                দুজনে মিলে এই প্রস্তাব পরিবেশন করি আমাদের এমন কিছু বন্ধুদের সামনে যারা লেখা-লিখির সঙ্গে আমাদের মতই সামান্য জড়িত। সেই সূত্রেই শুরু হয় আমাদের যাত্রা।
                                                এক এক করে স্বপ্ননীল , সায়ক , সোহান , অনির্বাণ সবাই এই উদ্যোগে উৎসাহিত হয়ে পাশে আসে। শুরু হয় আমাদের পথ চলা। বছর কাটে । পরিবর্তন ঘটে সেই এডিটর লিস্টের।
                                                সেখান থেকে আজ অনেকটা পথ এসেছি।
                                                কবিতা-গল্পের ছোট ম্যাগাজিন দিয়ে যা শুরু হয়েছিল তাই এখন কবিতা-গল্প-চিত্র-অডিও-ভিসুয়াল বিষয়াদির সমন্বয়ে এক বড় রূপ ধারণ করেছে।
                                                ঈপ্সিতা এবং রাজর্ষি কে এবছর পাশে পেয়েছি আমরা।
                                                তবে এই সমস্ত কিছুর পিছনে মূল কান্ডারী কিন্তু আসলে দেবার্ঘ্য। প্রস্তাব আনা থেকে শুরু করে প্রতি বছর পত্রিকা সাজানো সবই এক হাতে সামলে এসেছে।
                                                সঙ্গে সায়ক এবং সোহান। ক্রমাগত ৪ বছর ধরে ওর অক্লান্ত পরিশ্রম করেছে এই পত্রিকার জন্য।
                                                এবারে আমরা চেষ্টা করেছি কিছু মানুষের পাশে দাঁড়ানোর জন্য আর সেই উদ্যোগে পাশে পেয়েছি অনেক মানুষকে। আজ এই জায়গায় বসে তাই বলতে পারি "চেষ্টা থাকলে অনেক কিছুই সম্ভব হয়"।
                                                তবে জানি এখানে থেমে গেলে চলবে না।
                                                আরও অনেকখানি পথ চলা বাকি। পরিকল্পনা আছে বহু। কতটা বাস্তবায়ন সম্ভব তাতো সময়ই বলে দেবে। যারা পাশে এসে দাঁড়িয়েছে তাদের কাছে আমরা সত্যিই চির-কৃতজ্ঞ ।
                                                আশা করি ভবিষ্যতেও তাদেরকে পাশে পাব।</p>
                                        </div>
                                    </div>
                                    <i className="fas fa-quote-left fa2"></i>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div className="col-md-6">
                        <div className="wrap">
                            <div className="box">
                                <i className="fas fa-quote-left fa2"></i>
                                <div className="text">
                                    <i className="fas fa-quote-right fa1"></i>
                                    <h3>ঈপ্সিতা সর্দার </h3>
                                    <div className = "overflow-control">
                                    <div className="quote">
                                            <p>ছন্নছাড়ার মত ছড়িয়ে ছিটিয়ে হাজার দিন তো কেটেই গেল, এবার সঙ্গে চলো বন্ধু, একই পথে। যারা পৃথিবীকে একটাই দেশ ভাবে, এক পৃথিবী আনন্দ থাকুন তাদের সাথে।
                                                এভাবেই সব মানুষের এক হয়ে ওঠার নাম "আমাদের স্বাধীন কলম"।
                                                আমিও আছি তাকে সাজিয়ে তোলার জন্য, সবার সাথে। পুজোর ঠিক আগে সদ্য যখন আকাশ সাজে পেঁজা তুলোর মখমলে, ব্যস্ত হয়ে পড়ি সেই পুজোকে আরও অপরূপ করে তোলার আয়োজনে।
                                                একেবারে প্রথম থেকে এপথের যাত্রী নই যদিও;
                                                তবু কলম কখন জানি না এ কথা ভুলিয়ে দেয়- আমি নবাগতা। একটু একটু করে যখন পত্রিকা সম্পূর্ণ হয়ে ওঠে, তার একটা একটা অক্ষর জুড়ে জুড়ে শব্দরা প্রাণ পায়... শুধু লেখা নয়,
                                                অনেকগুলো মানুষের হৃদয়ামৃতে ভরে ওঠে।
                                                আলোর পথযাত্রী হওয়া‌ সহজ নয়, তবে আলোর সন্ধানে যেতে কীসের বারণ!
                                            </p>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div className="col-md-6 reverse">
                        <div className="wrap">
                            <div className="box">
                                <i className="fas fa-quote-right fa1"></i>
                                <div className="text">
                                    <h3>সোহান ঘোষ </h3>
                                    <div className="overflow-control">
                                        <div className = "quote">
                                            <p>ক্লাস ইলেভেনে ভর্তি হ‌ই সারদা বিদ্যাপীঠে । ওই সময়টাতেই লেখালেখি করাটা একপ্রকার নেশা হয়ে দাঁড়িয়েছিল । সেই নেশা সূত্রেই সারদা বিদ্যাপীঠের কিছু মানুষের সাথে আলাপ হয় গভীর ভাবে ,
                                                যাদের এখন ' বন্ধু ' বলতে পারি খুব সহজেই ।
                                                তাদের মধ্যে প্রথমজন অরিত্র , তারপর সায়ক আর সবশেষে পরিচয় হয় দেবার্ঘ্য'র সাথে । লেখা নিয়ে , বিশেষ করে কবিতা নিয়ে , ছন্দ নিয়ে , ধরণ নিয়ে আলোচনা হত প্রচুর ।
                                                ২০১৭ সালের পুজোর আগেই আমাদের মাথায় আসে একটা অনলাইন ম্যাগাজিন প্রকাশ করার ভাবনা । সায়ক , দেবার্ঘ্য আর আমি প্রথম থেকে সেই রয়ে গেছি ।
                                                অতটা ভেবে আমরা একটাবারের জন্য‌ও পিছিয়ে আসিনি , তারপর থেকে টানা তিনবছর এক‌ই উদ্যমে এই ম্যাগাজিনটার পিছনে কাজ করে গেছি আমরা । আরেকজনের নাম না বললেই নয় - স্বপ্ননীল ।
                                                ওই ছেলেটা প্রচণ্ড সাথ দিয়েছে এই ম্যাগাজিনটাকে এতদূর নিয়ে আসতে । আর অরিত্র তো সবসময়‌ই ছিল পাশে । তিনবছর পেরিয়ে এসে ২০২০ সালে আমাদের ম্যাগাজিন প্রকাশের ভাবনায় একটু বাধা আসে ,
                                                তবে অরিত্রর উদ্যমেই আবার শুরু হয় কাজ । যোগ দেয় ইপ্সিতা আর রাজর্ষি । অনেক পরিশ্রম করেছে দুজনেই । আস্তে আস্তে ম্যাগাজিন বড়ো হচ্ছে , অনেক নতুন ভাবনা জুড়ছে ম্যাগাজিনের সাথে ।
                                                তবে যেটুকু সফলতা এই ম্যাগাজিন অর্জন করেছে তার পিছনে সেই প্রথম থেকে যাঁরা ম্যাগাজিনের জন্য লেখা , ছবি , আঁকা দিয়ে গেছেন , যাঁরা পড়েছেন , যাঁরা উৎসাহ দিয়েছেন ,
                                                ভুল ধরিয়েছেন তাঁদের ভূমিকার অবশেষ নেই ।
                                                অত্যন্ত যত্নে স্বাধীন চিন্তায় আমাদের ম্যাগাজিন ' আমাদের স্বাধীন কলম ' আগামী বছরগুলোতেও পুজোবার্ষিকী হিসেবেই এক‌ইভাবে প্রকাশিত হবে ।
                                                যাঁরা এই লেখাটা ধৈর্য্য ধরে পড়লেন তাঁদের জন্য শ্রদ্ধা ও ভালোবাসা র‌ইল আমার তরফ থেকে ।
                                                ভালো থাকবেন । সুস্থ থাকবেন ।</p>
                                        </div>
                                    </div>
                                    <i className="fas fa-quote-left fa2"></i>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div className="col-md-6">
                        <div className="wrap">
                            <div className="box">
                                <i className="fas fa-quote-left fa2"></i>
                                <div className="text">
                                    <i className="fas fa-quote-right fa1"></i>
                                    <h3>সায়ক চক্রবর্তী </h3>
                                    <div className= "overflow-control">
                                    <div className="quote">
                                            <p>বিজ্ঞানের ছাত্র হয়ে সাহিত্যের প্রতি টানটা বিশেষ অস্বাভাবিক নয় কখনই।তাই সেখান থেকেই লেখালেখি আর তারপরেই আমাদের "স্বাধীন কলমের" সাথে জড়িয়ে পড়া।প্রথমে সাহিত‍্যের খাতিরেই এই বার্ষিকীটি প্রকাশ করতাম,
                                                কিন্তু ২০২০ একদমই আলাদা একটি সাল,তাই এবছরের ভাবনাও আলাদা।তাই হঠাৎ করেই মানুষের পাশে দাঁড়ানোর ইচ্ছেটাকে আঁকড়ে ধরে এবারের স্বাধীন কলম।বই এর সাথে আমাদের সম্পর্ক এখন আদায় কাঁচকলায়।
                                                তবুও যে কজন এগিয়ে আসেন ভালোবেসে,তারাই অনেক।আশা করব,"আসছে বছর আবার হবে, বছর বছর এগিয়ে যাবে।"</p>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                    {/*<div className="col-md-6 reverse">
                        <div className="wrap">
                            <div className="box">
                                <i className="fas fa-quote-right fa1"></i>
                                <div className="text">
                                    <h3>আত্রেয়ী হালদার </h3>
                                    <div className="overflow-control">
                                        <div className = "quote">
                                            <p>Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s,
                                                when an unknown printer took a galley of type and scrambled it to make a type specimen book.</p>
                                        </div>
                                    </div>
                                    <i className="fas fa-quote-left fa2"></i>
                                </div>
                            </div>
                        </div>
                    </div>*/}
                    <div className="col-md-6">
                        <div className="wrap">
                            <div className="box">
                                <i className="fas fa-quote-left fa2"></i>
                                <div className="text">
                                    <i className="fas fa-quote-right fa1"></i>
                                    <h3>রাজর্ষি চক্রবর্তী </h3>
                                    <div className = "overflow-control">
                                    <div className="quote">
                                            <p>পুজোর শুভেচ্ছা সকলকে। আমি রাজর্ষি , বর্তমানে কলকাতা নিবাসী এবং যাদবপুর বিশ্ববিদ্যালয়ের Architectural Engineering ডিপার্টমেন্টের স্টুডেন্ট।
                                                শব্দের প্রতি ভালোবাসা থেকে বর্তমানে সোশ্যাল মিডিয়ার পেজ "The Midnight Verse" -এর এডমিন আমি । এছাড়াও নিজের কিছু অলীক ভাবনা জোড়া লাগিয়ে নতুন কিছু তৈরির প্রচেষ্টারত ।
                                                আমাদের ম্যাগাজিন "আমাদের স্বাধীন কলম" 2017 সাল থেকে মুক্ত ভাবে তার ডানা মেলে ক্রমশ এগিয়ে চলেছে এবং 2020 সালে এই টিমের একজন সদস্য হিসেবে আমি গর্বিত ।
                                                সবশেষে বলি ভালো থাকুন , সুস্থ থাকুন ...ধন্যবাদ !</p>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>

                </div>
                
            </div>
        </div>
        );
}

export default Pen;